Funciones para la transformación de datos en SQL
===

* *90 min* | Última modificación: Junio 22, 2019

In [1]:
## conexión a la base de datos
%load_ext sql
%sql mysql+pymysql://root:@localhost
%config SqlMagic.autopandas = True
import pandas
pandas.set_option('display.notebook_repr_html', False)

In [2]:
%%sql
DROP DATABASE IF EXISTS SQLdb;
CREATE DATABASE SQLdb;
USE SQLdb;

CREATE TABLE persons (
    id INT,
    firstname VARCHAR(10),
    surname VARCHAR(10),
    birthday DATE,
    color VARCHAR(10),
    quantity INT
);

INSERT INTO persons VALUES
    (1,"Vivian","Hamilton","1971-07-08","green",1),
    (2,"Karen","Holcomb","1974-05-23","green",4),
    (3,"Cody","Garrett","1973-04-22","orange",1),
    (4,"Roth","Fry","1975-01-29","black",1),
    (5,"Zoe","Conway","1974-07-03","blue",2),
    (6,"Gretchen","Kinney","1974-10-18","viole",1),
    (7,"Driscoll","Klein","1970-10-05","blue",5),
    (8,"Karyn","Diaz","1969-02-24","red",1),
    (9,"Merritt","Guy","1974-10-17","indigo",4),
    (10,"Kylan","Sexton","1975-02-28","black",4),
    (11,"Jordan","Estes","1969-12-07","indigo",4),
    (12,"Hope","Coffey","1973-12-24","green",5),
    (13,"Vivian","Crane","1970-08-27","gray",5),
    (14,"Clio","Noel","1972-12-12","red",5),
    (15,"Hope","Silva","1970-07-01","blue",5),
    (16,"Ayanna","Jarvis","1974-02-11","orange",5),
    (17,"Chanda","Boyer","1973-04-01","green",4),
    (18,"Chadwick","Knight","1973-04-29","yellow",1);

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
18 rows affected.

Empty DataFrame
Columns: []
Index: []

---

> Haga click [aquí](https://dev.mysql.com/doc/refman/5.7/en/functions.html) para acceder al listado completo de funciones de MySQL.

---

## Strings

### CONCAT()

In [3]:
%%sql
SELECT 
    CONCAT(firstname,'@',surname),  
    quantity 
FROM 
    persons;

 * mysql+pymysql://root:***@localhost
18 rows affected.

   CONCAT(firstname,'@',surname)  quantity
0                Vivian@Hamilton         1
1                  Karen@Holcomb         4
2                   Cody@Garrett         1
3                       Roth@Fry         1
4                     Zoe@Conway         2
5                Gretchen@Kinney         1
6                 Driscoll@Klein         5
7                     Karyn@Diaz         1
8                    Merritt@Guy         4
9                   Kylan@Sexton         4
10                  Jordan@Estes         4
11                   Hope@Coffey         5
12                  Vivian@Crane         5
13                     Clio@Noel         5
14                    Hope@Silva         5
15                 Ayanna@Jarvis         5
16                  Chanda@Boyer         4
17               Chadwick@Knight         1

### LENGTH()

In [4]:
%%sql
SELECT surname, LENGTH(surname), CHAR_LENGTH(surname) FROM persons LIMIT 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

    surname  LENGTH(surname)  CHAR_LENGTH(surname)
0  Hamilton                8                     8
1   Holcomb                7                     7
2   Garrett                7                     7
3       Fry                3                     3
4    Conway                6                     6

### UPPER(), LOWER()

In [5]:
%%sql
SELECT surname, UPPER(surname), LOWER(surname) FROM persons LIMIT 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

    surname UPPER(surname) LOWER(surname)
0  Hamilton       HAMILTON       hamilton
1   Holcomb        HOLCOMB        holcomb
2   Garrett        GARRETT        garrett
3       Fry            FRY            fry
4    Conway         CONWAY         conway

In [6]:
%%sql
--
-- Condicional para strings
--
SELECT surname, surname BETWEEN 'c' AND 'k' FROM persons LIMIT 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

    surname  surname BETWEEN 'c' AND 'k'
0  Hamilton                            1
1   Holcomb                            1
2   Garrett                            1
3       Fry                            1
4    Conway                            1

### LIKE

La función LIKE permite buscar patrones específicos dentro de cadenas de caracteres.

    > LIKE 'a%'   : Encuentra los valores que inician con 'a'
    > LIKE '%a'   : Encuentra los valores que terminan con 'a'
    > LIKE '%a%'  : Encuentra los valores que contengan 'a' en cualquier posición
    > LIKE '_a%'  : Encuentra los valores que contengan 'a' en la segunda posición
    > LIKE 'a_%_%': Encuentra los valores que inician con 'a' y tienen al menos 3 caracteres
    > LIKE 'a%o'  : Encuentra los valores que inician con 'a' y terminan con 'o'

In [7]:
%%sql
SELECT * FROM persons WHERE color LIKE 'b%';

 * mysql+pymysql://root:***@localhost
5 rows affected.

   id firstname surname    birthday  color  quantity
0   4      Roth     Fry  1975-01-29  black         1
1   5       Zoe  Conway  1974-07-03   blue         2
2   7  Driscoll   Klein  1970-10-05   blue         5
3  10     Kylan  Sexton  1975-02-28  black         4
4  15      Hope   Silva  1970-07-01   blue         5

In [8]:
%%sql
SELECT * FROM persons WHERE color NOT LIKE 'b%';

 * mysql+pymysql://root:***@localhost
13 rows affected.

    id firstname   surname    birthday   color  quantity
0    1    Vivian  Hamilton  1971-07-08   green         1
1    2     Karen   Holcomb  1974-05-23   green         4
2    3      Cody   Garrett  1973-04-22  orange         1
3    6  Gretchen    Kinney  1974-10-18   viole         1
4    8     Karyn      Diaz  1969-02-24     red         1
5    9   Merritt       Guy  1974-10-17  indigo         4
6   11    Jordan     Estes  1969-12-07  indigo         4
7   12      Hope    Coffey  1973-12-24   green         5
8   13    Vivian     Crane  1970-08-27    gray         5
9   14      Clio      Noel  1972-12-12     red         5
10  16    Ayanna    Jarvis  1974-02-11  orange         5
11  17    Chanda     Boyer  1973-04-01   green         4
12  18  Chadwick    Knight  1973-04-29  yellow         1

In [9]:
%%sql
--
-- Conectores lógicos (AND).
--
SELECT * FROM persons WHERE color = 'blue' AND firstname LIKE 'Z%';

 * mysql+pymysql://root:***@localhost
1 rows affected.

   id firstname surname    birthday color  quantity
0   5       Zoe  Conway  1974-07-03  blue         2

In [10]:
%%sql
--
-- Conectores lógicos (OR).
--
SELECT * FROM persons WHERE color = 'blue' OR firstname LIKE 'K%';

 * mysql+pymysql://root:***@localhost
6 rows affected.

   id firstname  surname    birthday  color  quantity
0   2     Karen  Holcomb  1974-05-23  green         4
1   5       Zoe   Conway  1974-07-03   blue         2
2   7  Driscoll    Klein  1970-10-05   blue         5
3   8     Karyn     Diaz  1969-02-24    red         1
4  10     Kylan   Sexton  1975-02-28  black         4
5  15      Hope    Silva  1970-07-01   blue         5

In [11]:
%%sql
--
-- Condicional para campos string
--
SELECT * FROM persons WHERE color IN ('blue','black');

 * mysql+pymysql://root:***@localhost
5 rows affected.

   id firstname surname    birthday  color  quantity
0   4      Roth     Fry  1975-01-29  black         1
1   5       Zoe  Conway  1974-07-03   blue         2
2   7  Driscoll   Klein  1970-10-05   blue         5
3  10     Kylan  Sexton  1975-02-28  black         4
4  15      Hope   Silva  1970-07-01   blue         5

In [12]:
%%sql
--
-- Condicional para campos string
--
SELECT * FROM persons WHERE color NOT IN ('blue','black');

 * mysql+pymysql://root:***@localhost
13 rows affected.

    id firstname   surname    birthday   color  quantity
0    1    Vivian  Hamilton  1971-07-08   green         1
1    2     Karen   Holcomb  1974-05-23   green         4
2    3      Cody   Garrett  1973-04-22  orange         1
3    6  Gretchen    Kinney  1974-10-18   viole         1
4    8     Karyn      Diaz  1969-02-24     red         1
5    9   Merritt       Guy  1974-10-17  indigo         4
6   11    Jordan     Estes  1969-12-07  indigo         4
7   12      Hope    Coffey  1973-12-24   green         5
8   13    Vivian     Crane  1970-08-27    gray         5
9   14      Clio      Noel  1972-12-12     red         5
10  16    Ayanna    Jarvis  1974-02-11  orange         5
11  17    Chanda     Boyer  1973-04-01   green         4
12  18  Chadwick    Knight  1973-04-29  yellow         1

### REGEXP

In [13]:
%%sql
--
-- El primer caracter es una 'b'
--
SELECT * FROM persons WHERE color REGEXP '^b';

 * mysql+pymysql://root:***@localhost
5 rows affected.

   id firstname surname    birthday  color  quantity
0   4      Roth     Fry  1975-01-29  black         1
1   5       Zoe  Conway  1974-07-03   blue         2
2   7  Driscoll   Klein  1970-10-05   blue         5
3  10     Kylan  Sexton  1975-02-28  black         4
4  15      Hope   Silva  1970-07-01   blue         5

In [14]:
%%sql
--
-- El primer caracter no es una 'b'
--
SELECT * FROM persons WHERE color REGEXP '^[^b]';

 * mysql+pymysql://root:***@localhost
13 rows affected.

    id firstname   surname    birthday   color  quantity
0    1    Vivian  Hamilton  1971-07-08   green         1
1    2     Karen   Holcomb  1974-05-23   green         4
2    3      Cody   Garrett  1973-04-22  orange         1
3    6  Gretchen    Kinney  1974-10-18   viole         1
4    8     Karyn      Diaz  1969-02-24     red         1
5    9   Merritt       Guy  1974-10-17  indigo         4
6   11    Jordan     Estes  1969-12-07  indigo         4
7   12      Hope    Coffey  1973-12-24   green         5
8   13    Vivian     Crane  1970-08-27    gray         5
9   14      Clio      Noel  1972-12-12     red         5
10  16    Ayanna    Jarvis  1974-02-11  orange         5
11  17    Chanda     Boyer  1973-04-01   green         4
12  18  Chadwick    Knight  1973-04-29  yellow         1

In [15]:
%%sql
--
-- El primer caracter no es una 'b'
--
SELECT * FROM persons WHERE color REGEXP 'blue|green';

 * mysql+pymysql://root:***@localhost
7 rows affected.

   id firstname   surname    birthday  color  quantity
0   1    Vivian  Hamilton  1971-07-08  green         1
1   2     Karen   Holcomb  1974-05-23  green         4
2   5       Zoe    Conway  1974-07-03   blue         2
3   7  Driscoll     Klein  1970-10-05   blue         5
4  12      Hope    Coffey  1973-12-24  green         5
5  15      Hope     Silva  1970-07-01   blue         5
6  17    Chanda     Boyer  1973-04-01  green         4

In [16]:
%%sql
--
-- El segundo caracter es una 'r'
--
SELECT * FROM persons WHERE color REGEXP '.r';

 * mysql+pymysql://root:***@localhost
7 rows affected.

   id firstname   surname    birthday   color  quantity
0   1    Vivian  Hamilton  1971-07-08   green         1
1   2     Karen   Holcomb  1974-05-23   green         4
2   3      Cody   Garrett  1973-04-22  orange         1
3  12      Hope    Coffey  1973-12-24   green         5
4  13    Vivian     Crane  1970-08-27    gray         5
5  16    Ayanna    Jarvis  1974-02-11  orange         5
6  17    Chanda     Boyer  1973-04-01   green         4

In [17]:
%%sql
--
-- Finaliza en una vocal
--
SELECT * FROM persons WHERE color REGEXP '[aeiou]$';

 * mysql+pymysql://root:***@localhost
8 rows affected.

   id firstname  surname    birthday   color  quantity
0   3      Cody  Garrett  1973-04-22  orange         1
1   5       Zoe   Conway  1974-07-03    blue         2
2   6  Gretchen   Kinney  1974-10-18   viole         1
3   7  Driscoll    Klein  1970-10-05    blue         5
4   9   Merritt      Guy  1974-10-17  indigo         4
5  11    Jordan    Estes  1969-12-07  indigo         4
6  15      Hope    Silva  1970-07-01    blue         5
7  16    Ayanna   Jarvis  1974-02-11  orange         5

In [18]:
%%sql
--
-- Inicia con una mayúscula
--
SELECT * FROM persons WHERE color REGEXP '^[[:upper:]]';

 * mysql+pymysql://root:***@localhost
18 rows affected.

    id firstname   surname    birthday   color  quantity
0    1    Vivian  Hamilton  1971-07-08   green         1
1    2     Karen   Holcomb  1974-05-23   green         4
2    3      Cody   Garrett  1973-04-22  orange         1
3    4      Roth       Fry  1975-01-29   black         1
4    5       Zoe    Conway  1974-07-03    blue         2
5    6  Gretchen    Kinney  1974-10-18   viole         1
6    7  Driscoll     Klein  1970-10-05    blue         5
7    8     Karyn      Diaz  1969-02-24     red         1
8    9   Merritt       Guy  1974-10-17  indigo         4
9   10     Kylan    Sexton  1975-02-28   black         4
10  11    Jordan     Estes  1969-12-07  indigo         4
11  12      Hope    Coffey  1973-12-24   green         5
12  13    Vivian     Crane  1970-08-27    gray         5
13  14      Clio      Noel  1972-12-12     red         5
14  15      Hope     Silva  1970-07-01    blue         5
15  16    Ayanna    Jarvis  1974-02-11  orange         5
16  17    Chanda     Boyer  1973-04-01   green         4
17  18  Chadwick    Knight  1973-04-29  yellow         1

### LEFT(), MID(), SUBSTRING(), RIGHT()

In [19]:
%%sql
--
--
--
SELECT 
    firstname, 
    LEFT(firstname, 2), 
    MID(firstname, 3, 2), 
    SUBSTRING(firstname, 3, 2), 
    RIGHT(firstname, 2) 
FROM 
    persons;

 * mysql+pymysql://root:***@localhost
18 rows affected.

   firstname LEFT(firstname, 2) MID(firstname, 3, 2)  \
0     Vivian                 Vi                   vi
1      Karen                 Ka                   re
2       Cody                 Co                   dy
3       Roth                 Ro                   th
4        Zoe                 Zo                    e
5   Gretchen                 Gr                   et
6   Driscoll                 Dr                   is
7      Karyn                 Ka                   ry
8    Merritt                 Me                   rr
9      Kylan                 Ky                   la
10    Jordan                 Jo                   rd
11      Hope                 Ho                   pe
12    Vivian                 Vi                   vi
13      Clio                 Cl                   io
14      Hope                 Ho                   pe
15    Ayanna                 Ay                   an
16    Chanda                 Ch                   an
17  Chadwick                 Ch                   ad

   SUBSTRING(firstname, 3, 2) RIGHT(firstname, 2)
0                          vi                  an
1                          re                  en
2                          dy                  dy
3                          th                  th
4                           e                  oe
5                          et                  en
6                          is                  ll
7                          ry                  yn
8                          rr                  tt
9                          la                  an
10                         rd                  an
11                         pe                  pe
12                         vi                  an
13                         io                  io
14                         pe                  pe
15                         an                  na
16                         an                  da
17                         ad                  ck

In [20]:
%%sql
--
-- Por posición
--
SELECT  
    firstname,
    SUBSTRING_INDEX(firstname, 'a', 1),
    SUBSTRING_INDEX(firstname, 'a', -1)
FROM 
    persons;

 * mysql+pymysql://root:***@localhost
18 rows affected.

   firstname SUBSTRING_INDEX(firstname, 'a', 1)  \
0     Vivian                               Vivi
1      Karen                                  K
2       Cody                               Cody
3       Roth                               Roth
4        Zoe                                Zoe
5   Gretchen                           Gretchen
6   Driscoll                           Driscoll
7      Karyn                                  K
8    Merritt                            Merritt
9      Kylan                                Kyl
10    Jordan                               Jord
11      Hope                               Hope
12    Vivian                               Vivi
13      Clio                               Clio
14      Hope                               Hope
15    Ayanna                                 Ay
16    Chanda                                 Ch
17  Chadwick                                 Ch

   SUBSTRING_INDEX(firstname, 'a', -1)
0                                    n
1                                  ren
2                                 Cody
3                                 Roth
4                                  Zoe
5                             Gretchen
6                             Driscoll
7                                  ryn
8                              Merritt
9                                    n
10                                   n
11                                Hope
12                                   n
13                                Clio
14                                Hope
15
16
17                               dwick

In [21]:
%%sql
--
-- Operadores relacionales con strings
--
SELECT firstname FROM persons WHERE LEFT(firstname, 1) >= 'm';

 * mysql+pymysql://root:***@localhost
5 rows affected.

  firstname
0    Vivian
1      Roth
2       Zoe
3   Merritt
4    Vivian

### LOCATE()

In [22]:
%%sql
--
-- Retorna la posición del substring
--
SELECT firstname, LOCATE('ia', firstname) FROM persons;

 * mysql+pymysql://root:***@localhost
18 rows affected.

   firstname  LOCATE('ia', firstname)
0     Vivian                        4
1      Karen                        0
2       Cody                        0
3       Roth                        0
4        Zoe                        0
5   Gretchen                        0
6   Driscoll                        0
7      Karyn                        0
8    Merritt                        0
9      Kylan                        0
10    Jordan                        0
11      Hope                        0
12    Vivian                        4
13      Clio                        0
14      Hope                        0
15    Ayanna                        0
16    Chanda                        0
17  Chadwick                        0

## Fecha y hora

### DATE_FORMAT()

In [23]:
%%sql
--
-- Formatos para el año
--
SELECT 
    birthday, 
    DATE_FORMAT(birthday, "%Y   %y")
FROM 
    persons
LIMIT
    5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

     birthday DATE_FORMAT(birthday, "%Y   %y")
0  1971-07-08                        1971   71
1  1974-05-23                        1974   74
2  1973-04-22                        1973   73
3  1975-01-29                        1975   75
4  1974-07-03                        1974   74

In [24]:
%%sql
--
-- Formatos para el mes
--
SELECT 
    birthday, 
    DATE_FORMAT(birthday, "%M  %m %c")
FROM 
    persons
LIMIT
    5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

     birthday DATE_FORMAT(birthday, "%M  %m %c")
0  1971-07-08                         July  07 7
1  1974-05-23                          May  05 5
2  1973-04-22                        April  04 4
3  1975-01-29                      January  01 1
4  1974-07-03                         July  07 7

In [25]:
%%sql
--
-- Formatos para el dia
--
SELECT 
    birthday, 
    DATE_FORMAT(birthday, "%e  %W")
FROM 
    persons
LIMIT
    5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

     birthday DATE_FORMAT(birthday, "%e  %W")
0  1971-07-08                     8  Thursday
1  1974-05-23                    23  Thursday
2  1973-04-22                      22  Sunday
3  1975-01-29                   29  Wednesday
4  1974-07-03                    3  Wednesday

### CURDATE(), CURTIME(), NOW()

In [26]:
%%sql
SELECT CURDATE(), CURTIME(), NOW();

 * mysql+pymysql://root:***@localhost
1 rows affected.

    CURDATE() CURTIME()               NOW()
0  2018-12-20  02:26:39 2018-12-20 02:26:39

### YEAR(), MONTH(), DAYNAME(), ...

In [27]:
%%sql
DROP TABLE IF EXISTS tbltime; 
CREATE TABLE tbltime (t TIME, ts TIMESTAMP, d DATE);
INSERT INTO tbltime VALUES
    ("14:23:18", "2018-08-23 14:23:18", "2018-08-23"),
    ("05:45:23", "2016-05-14 05:45:23", "2016-05-14"),
    ("11:10:45", "2017-07-01 11:10:45", "2017-07-01");
SELECT * FROM tbltime;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
3 rows affected.
3 rows affected.

/usr/local/lib/python3.6/dist-packages/pymysql/cursors.py:170: Warning: (1051, "Unknown table 'SQLdb.tbltime'")
  result = self._query(query)

         t                  ts           d
0 14:23:18 2018-08-23 14:23:18  2018-08-23
1 05:45:23 2016-05-14 05:45:23  2016-05-14
2 11:10:45 2017-07-01 11:10:45  2017-07-01

In [28]:
%%sql
SELECT
    ts,
    YEAR(ts),
    MONTH(ts),
    MONTHNAME(ts)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  YEAR(ts)  MONTH(ts) MONTHNAME(ts)
0 2018-08-23 14:23:18      2018          8        August
1 2016-05-14 05:45:23      2016          5           May
2 2017-07-01 11:10:45      2017          7          July

In [29]:
%%sql
SELECT
    ts,
    DAYOFMONTH(ts),
    DAYNAME(ts),
    DAYOFWEEK(ts),
    WEEKDAY(ts),
    DAYOFYEAR(ts)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  DAYOFMONTH(ts) DAYNAME(ts)  DAYOFWEEK(ts)  WEEKDAY(ts)  \
0 2018-08-23 14:23:18              23    Thursday              5            3
1 2016-05-14 05:45:23              14    Saturday              7            5
2 2017-07-01 11:10:45               1    Saturday              7            5

   DAYOFYEAR(ts)
0            235
1            135
2            182

In [30]:
%%sql
SELECT
    ts,
    HOUR(ts),
    MINUTE(ts),
    SECOND(ts)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  HOUR(ts)  MINUTE(ts)  SECOND(ts)
0 2018-08-23 14:23:18        14          23          18
1 2016-05-14 05:45:23         5          45          23
2 2017-07-01 11:10:45        11          10          45

In [31]:
%%sql
SELECT
    ts,
    EXTRACT(YEAR FROM ts),
    EXTRACT(MONTH FROM ts),
    EXTRACT(HOUR FROM ts),
    EXTRACT(HOUR FROM ts),
    EXTRACT(MINUTE FROM ts),
    EXTRACT(SECOND FROM ts)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  EXTRACT(YEAR FROM ts)  EXTRACT(MONTH FROM ts)  \
0 2018-08-23 14:23:18                   2018                       8
1 2016-05-14 05:45:23                   2016                       5
2 2017-07-01 11:10:45                   2017                       7

   EXTRACT(HOUR FROM ts)  EXTRACT(HOUR FROM ts)  EXTRACT(MINUTE FROM ts)  \
0                     14                     14                       23
1                      5                      5                       45
2                     11                     11                       10

   EXTRACT(SECOND FROM ts)
0                       18
1                       23
2                       45

### TIME_TO_SEC(), SEC_TO_TIME()

In [32]:
%%sql
SELECT
    t,
    TIME_TO_SEC(t),
    SEC_TO_TIME(TIME_TO_SEC(t))
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t  TIME_TO_SEC(t) SEC_TO_TIME(TIME_TO_SEC(t))
0 14:23:18           51798                    14:23:18
1 05:45:23           20723                    05:45:23
2 11:10:45           40245                    11:10:45

### FROM_DAYS(), TO_DAYS()

In [33]:
%%sql
SELECT
    ts,
    TO_DAYS(ts),
    FROM_DAYS(TO_DAYS(ts))
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  TO_DAYS(ts) FROM_DAYS(TO_DAYS(ts))
0 2018-08-23 14:23:18       737294             2018-08-23
1 2016-05-14 05:45:23       736463             2016-05-14
2 2017-07-01 11:10:45       736876             2017-07-01

### UNIX_TIMESTAMP, FROM_UNIXTIME()

In [34]:
%%sql
SELECT 
    ts,
    UNIX_TIMESTAMP(ts),
    FROM_UNIXTIME(UNIX_TIMESTAMP(ts))
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  UNIX_TIMESTAMP(ts) FROM_UNIXTIME(UNIX_TIMESTAMP(ts))
0 2018-08-23 14:23:18          1535034198               2018-08-23 14:23:18
1 2016-05-14 05:45:23          1463204723               2016-05-14 05:45:23
2 2017-07-01 11:10:45          1498907445               2017-07-01 11:10:45

### TIMEDIFF(), DATEDIFF(), TIMESTAMPDIFF()

In [35]:
%%sql
SELECT
    d,
    DATEDIFF("2018-12-30", d)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

            d  DATEDIFF("2018-12-30", d)
0  2018-08-23                        129
1  2016-05-14                        960
2  2017-07-01                        547

In [36]:
%%sql
SELECT
    t,
    TIMEDIFF("23:05:18", t)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t TIMEDIFF("23:05:18", t)
0 14:23:18                08:42:00
1 05:45:23                17:19:55
2 11:10:45                11:54:33

In [37]:
%%sql
SELECT
    ts,
    TIMESTAMPDIFF(YEAR, ts, "2018-12-31 23:05:18"),
    TIMESTAMPDIFF(MONTH, ts, "2018-12-31 23:05:18"),
    TIMESTAMPDIFF(WEEK, ts, "2018-12-31 23:05:18")
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

                   ts  TIMESTAMPDIFF(YEAR, ts, "2018-12-31 23:05:18")  \
0 2018-08-23 14:23:18                                               0
1 2016-05-14 05:45:23                                               2
2 2017-07-01 11:10:45                                               1

   TIMESTAMPDIFF(MONTH, ts, "2018-12-31 23:05:18")  \
0                                                4
1                                               31
2                                               17

   TIMESTAMPDIFF(WEEK, ts, "2018-12-31 23:05:18")
0                                              18
1                                             137
2                                              78

### ADDTIME()

In [38]:
%%sql
SELECT
    t,
    ADDTIME("23:05:18", t)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t ADDTIME("23:05:18", t)
0 14:23:18               37:28:36
1 05:45:23               28:50:41
2 11:10:45               34:16:03

In [39]:
%%sql
SELECT
    d,
    DATE_ADD(d, INTERVAL 3 DAY),
    DATE_SUB(d, INTERVAL 3 DAY)
FROM
    tbltime;

 * mysql+pymysql://root:***@localhost
3 rows affected.

            d DATE_ADD(d, INTERVAL 3 DAY) DATE_SUB(d, INTERVAL 3 DAY)
0  2018-08-23                  2018-08-26                  2018-08-20
1  2016-05-14                  2016-05-17                  2016-05-11
2  2017-07-01                  2017-07-04                  2017-06-28

In [40]:
%%sql
SELECT
    d
FROM
    tbltime
WHERE 
    d BETWEEN "2017-01-01" AND "2017-12-31";

 * mysql+pymysql://root:***@localhost
1 rows affected.

            d
0  2017-07-01

## ORDER BY

In [41]:
%%sql
SELECT * FROM persons ORDER BY color;

 * mysql+pymysql://root:***@localhost
18 rows affected.

    id firstname   surname    birthday   color  quantity
0    4      Roth       Fry  1975-01-29   black         1
1   10     Kylan    Sexton  1975-02-28   black         4
2   15      Hope     Silva  1970-07-01    blue         5
3    5       Zoe    Conway  1974-07-03    blue         2
4    7  Driscoll     Klein  1970-10-05    blue         5
5   13    Vivian     Crane  1970-08-27    gray         5
6    2     Karen   Holcomb  1974-05-23   green         4
7   17    Chanda     Boyer  1973-04-01   green         4
8   12      Hope    Coffey  1973-12-24   green         5
9    1    Vivian  Hamilton  1971-07-08   green         1
10   9   Merritt       Guy  1974-10-17  indigo         4
11  11    Jordan     Estes  1969-12-07  indigo         4
12   3      Cody   Garrett  1973-04-22  orange         1
13  16    Ayanna    Jarvis  1974-02-11  orange         5
14   8     Karyn      Diaz  1969-02-24     red         1
15  14      Clio      Noel  1972-12-12     red         5
16   6  Gretchen    Kinney  1974-10-18   viole         1
17  18  Chadwick    Knight  1973-04-29  yellow         1

In [42]:
%%sql
SELECT * FROM tbltime ORDER BY t;

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t                  ts           d
0 05:45:23 2016-05-14 05:45:23  2016-05-14
1 11:10:45 2017-07-01 11:10:45  2017-07-01
2 14:23:18 2018-08-23 14:23:18  2018-08-23

In [43]:
%%sql
SELECT * FROM tbltime ORDER BY ts;

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t                  ts           d
0 05:45:23 2016-05-14 05:45:23  2016-05-14
1 11:10:45 2017-07-01 11:10:45  2017-07-01
2 14:23:18 2018-08-23 14:23:18  2018-08-23

In [44]:
%%sql
SELECT * FROM tbltime ORDER BY DAY(ts);

 * mysql+pymysql://root:***@localhost
3 rows affected.

         t                  ts           d
0 11:10:45 2017-07-01 11:10:45  2017-07-01
1 05:45:23 2016-05-14 05:45:23  2016-05-14
2 14:23:18 2018-08-23 14:23:18  2018-08-23

In [45]:
%%sql
--
-- Se altera el orden del ordenamiento
--
SELECT * FROM persons ORDER BY FIELD(color, 'blue');

 * mysql+pymysql://root:***@localhost
18 rows affected.

    id firstname   surname    birthday   color  quantity
0   10     Kylan    Sexton  1975-02-28   black         4
1   18  Chadwick    Knight  1973-04-29  yellow         1
2   17    Chanda     Boyer  1973-04-01   green         4
3   16    Ayanna    Jarvis  1974-02-11  orange         5
4   14      Clio      Noel  1972-12-12     red         5
5   13    Vivian     Crane  1970-08-27    gray         5
6   12      Hope    Coffey  1973-12-24   green         5
7   11    Jordan     Estes  1969-12-07  indigo         4
8    1    Vivian  Hamilton  1971-07-08   green         1
9    9   Merritt       Guy  1974-10-17  indigo         4
10   8     Karyn      Diaz  1969-02-24     red         1
11   6  Gretchen    Kinney  1974-10-18   viole         1
12   4      Roth       Fry  1975-01-29   black         1
13   3      Cody   Garrett  1973-04-22  orange         1
14   2     Karen   Holcomb  1974-05-23   green         4
15   7  Driscoll     Klein  1970-10-05    blue         5
16   5       Zoe    Conway  1974-07-03    blue         2
17  15      Hope     Silva  1970-07-01    blue         5

## GROUP BY

### COUNT()

In [46]:
%%sql
--
-- Cuenta cuantos registros hay en la tabla.
--
SELECT COUNT(*) FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

   COUNT(*)
0        18

In [47]:
%%sql
--
-- Calcula la suma de edades en personas
--
SELECT SUM(TIMESTAMPDIFF(YEAR,birthday,CURDATE())) AS SUMA FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

  SUMA
0  820

In [48]:
%%sql
--
-- Cuenta cuantas veces aparece cada año
-- de nacimiento en la tabla.
--
SELECT YEAR(birthday), COUNT(*) FROM persons GROUP BY YEAR(birthday);

 * mysql+pymysql://root:***@localhost
7 rows affected.

   YEAR(birthday)  COUNT(*)
0            1969         2
1            1970         3
2            1971         1
3            1972         1
4            1973         4
5            1974         5
6            1975         2

In [49]:
%%sql
--
-- Cuenta cuantas veces aparece cada año
-- de nacimiento en la tabla.
--
SELECT YEAR(birthday), COUNT(*) FROM persons GROUP BY YEAR(birthday);

 * mysql+pymysql://root:***@localhost
7 rows affected.

   YEAR(birthday)  COUNT(*)
0            1969         2
1            1970         3
2            1971         1
3            1972         1
4            1973         4
5            1974         5
6            1975         2

### MAX(), MIN(), SUM(), AVG()

In [50]:
%%sql
SELECT 
    color,
    MAX(quantity),
    MIN(quantity),
    SUM(quantity),
    AVG(quantity)
FROM
    persons
GROUP BY
    color;

 * mysql+pymysql://root:***@localhost
9 rows affected.

    color  MAX(quantity)  MIN(quantity) SUM(quantity) AVG(quantity)
0   black              4              1             5        2.5000
1    blue              5              2            12        4.0000
2    gray              5              5             5        5.0000
3   green              5              1            14        3.5000
4  indigo              4              4             8        4.0000
5  orange              5              1             6        3.0000
6     red              5              1             6        3.0000
7   viole              1              1             1        1.0000
8  yellow              1              1             1        1.0000

In [51]:
%%sql
--
-- Selecciona los colores que tengan una cantidad
-- igual a la minima
--
SELECT 
    color,
    quantity
FROM
    persons
WHERE
    quantity = (SELECT MIN(quantity) FROM persons);

 * mysql+pymysql://root:***@localhost
6 rows affected.

    color  quantity
0   green         1
1  orange         1
2   black         1
3   viole         1
4     red         1
5  yellow         1